Revit 2024 API
LoadUsage Class
 An object that represents a load usage.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class LoadUsage : Element
Visual Basic
Public Class LoadUsage _
	Inherits Element
Visual C++
public ref class LoadUsage : public Element
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Structure.LoadUsage
See Also
LoadUsage Members
Autodesk.Revit.DB.Structure Namespace